---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.MirrorProjectSuccess
source: html/96da4d9b-c47d-4075-b3cd-46cdc6bd1a72.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.MirrorProjectSuccess Property

[Action] command has successfully processed [Number] elements

## Syntax (C#)
```csharp
public static FailureDefinitionId MirrorProjectSuccess { get; }
```